app/controllers/students_controller.rb

    def new
       @student = Student.create
---
INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-10-30 22:00:25.619153"], ["updated_at", "2020-10-30 22:00:25.619153"]]

    def destroy
        @student = Student.find(params[:id])
        @student.delete
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 3]]